AmrGaber1/Register-file-definition-for-Atmega32/Python def Automate/register_definition_file_23_09_21_21_26_14.h
/*Register: SPMCR*/
typedef union{
	uint8 Byte;
	struct{
		uint8 SPMEN :1;
		uint8 PGERS :1;
		uint8 PGWRT :1;
		uint8 BLBSET :1;
		uint8 RWWSRE :1;
		uint8 :1;
		uint8 RWWSB :1;
		uint8 SPMIE :1;
	}Bits;
}SPMCR_reg_type;
/*SPMCR Address Access Macro*/
#define SPMCR_REG      (*(volatile SPMCR_reg_type * const)0x37)
/*SPMCR Bit Macros*/
#define _SPMCR_SPMEN_POSITION           0x0
#define _SPMCR_SPMEN_MASK               0x1
#define _SPMCR_PGERS_POSITION           0x1
#define _SPMCR_PGERS_MASK               0x2
#define _SPMCR_PGWRT_POSITION           0x2
#define _SPMCR_PGWRT_MASK               0x4
#define _SPMCR_BLBSET_POSITION          0x3
#define _SPMCR_BLBSET_MASK              0x8
#define _SPMCR_RWWSRE_POSITION          0x4
#define _SPMCR_RWWSRE_MASK              0x10
#define _SPMCR_RWWSB_POSITION           0x6
#define _SPMCR_RWWSB_MASK               0x40
#define _SPMCR_SPMIE_POSITION           0x7
#define _SPMCR_SPMIE_MASK               0x80


/*Register: TWCR*/
typedef union{
	uint8 Byte;
	struct{
		uint8 TWIE :1;
		uint8 :1;
		uint8 TWEN :1;
		uint8 TWWC :1;
		uint8 TWSTO :1;
		uint8 TWSTA :1;
		uint8 TWEA :1;
		uint8 TWINT :1;
	}Bits;
}TWCR_reg_type;
/*TWCR Address Access Macro*/
#define TWCR_REG      (*(volatile TWCR_reg_type * const)0x36)
/*TWCR Bit Macros*/
#define _TWCR_TWIE_POSITION             0x0
#define _TWCR_TWIE_MASK                 0x1
#define _TWCR_TWEN_POSITION             0x2
#define _TWCR_TWEN_MASK                 0x4
#define _TWCR_TWWC_POSITION             0x3
#define _TWCR_TWWC_MASK                 0x8
#define _TWCR_TWSTO_POSITION            0x4
#define _TWCR_TWSTO_MASK                0x10
#define _TWCR_TWSTA_POSITION            0x5
#define _TWCR_TWSTA_MASK                0x20
#define _TWCR_TWEA_POSITION             0x6
#define _TWCR_TWEA_MASK                 0x40
#define _TWCR_TWINT_POSITION            0x7
#define _TWCR_TWINT_MASK                0x80


/*Register: MCUCR*/
typedef union{
	uint8 Byte;
	struct{
		uint8 ISC00 :1;
		uint8 ISC01 :1;
		uint8 ISC10 :1;
		uint8 ISC11 :1;
		uint8 SM0 :1;
		uint8 SM1 :1;
		uint8 SM2 :1;
		uint8 SE :1;
	}Bits;
}MCUCR_reg_type;
/*MCUCR Address Access Macro*/
#define MCUCR_REG      (*(volatile MCUCR_reg_type * const)0x35)
/*MCUCR Bit Macros*/
#define _MCUCR_ISC00_POSITION           0x0
#define _MCUCR_ISC00_MASK               0x1
#define _MCUCR_ISC01_POSITION           0x1
#define _MCUCR_ISC01_MASK               0x2
#define _MCUCR_ISC10_POSITION           0x2
#define _MCUCR_ISC10_MASK               0x4
#define _MCUCR_ISC11_POSITION           0x3
#define _MCUCR_ISC11_MASK               0x8
#define _MCUCR_SM0_POSITION             0x4
#define _MCUCR_SM0_MASK                 0x10
#define _MCUCR_SM1_POSITION             0x5
#define _MCUCR_SM1_MASK                 0x20
#define _MCUCR_SM2_POSITION             0x6
#define _MCUCR_SM2_MASK                 0x40
#define _MCUCR_SE_POSITION              0x7
#define _MCUCR_SE_MASK                  0x80


/*Register: MCUCSR*/
typedef union{
	uint8 Byte;
	struct{
		uint8 PORF :1;
		uint8 EXTRF :1;
		uint8 BORF :1;
		uint8 WDRF :1;
		uint8 JTRF :1;
		uint8 :1;
		uint8 ISC2 :1;
		uint8 JTD :1;
	}Bits;
}MCUCSR_reg_type;
/*MCUCSR Address Access Macro*/
#define MCUCSR_REG      (*(volatile MCUCSR_reg_type * const)0x34)
/*MCUCSR Bit Macros*/
#define _MCUCSR_PORF_POSITION           0x0
#define _MCUCSR_PORF_MASK               0x1
#define _MCUCSR_EXTRF_POSITION          0x1
#define _MCUCSR_EXTRF_MASK              0x2
#define _MCUCSR_BORF_POSITION           0x2
#define _MCUCSR_BORF_MASK               0x4
#define _MCUCSR_WDRF_POSITION           0x3
#define _MCUCSR_WDRF_MASK               0x8
#define _MCUCSR_JTRF_POSITION           0x4
#define _MCUCSR_JTRF_MASK               0x10
#define _MCUCSR_ISC2_POSITION           0x6
#define _MCUCSR_ISC2_MASK               0x40
#define _MCUCSR_JTD_POSITION            0x7
#define _MCUCSR_JTD_MASK                0x80


/*Register: TCCR0*/
typedef union{
	uint8 Byte;
	struct{
		uint8 CS00 :1;
		uint8 CS01 :1;
		uint8 CS02 :1;
		uint8 WGM01 :1;
		uint8 COM00 :1;
		uint8 COM01 :1;
		uint8 WGM00 :1;
		uint8 FOC0 :1;
	}Bits;
}TCCR0_reg_type;
/*TCCR0 Address Access Macro*/
#define TCCR0_REG      (*(volatile TCCR0_reg_type * const)0x33)
/*TCCR0 Bit Macros*/
#define _TCCR0_CS00_POSITION            0x0
#define _TCCR0_CS00_MASK                0x1
#define _TCCR0_CS01_POSITION            0x1
#define _TCCR0_CS01_MASK                0x2
#define _TCCR0_CS02_POSITION            0x2
#define _TCCR0_CS02_MASK                0x4
#define _TCCR0_WGM01_POSITION           0x3
#define _TCCR0_WGM01_MASK               0x8
#define _TCCR0_COM00_POSITION           0x4
#define _TCCR0_COM00_MASK               0x10
#define _TCCR0_COM01_POSITION           0x5
#define _TCCR0_COM01_MASK               0x20
#define _TCCR0_WGM00_POSITION           0x6
#define _TCCR0_WGM00_MASK               0x40
#define _TCCR0_FOC0_POSITION            0x7
#define _TCCR0_FOC0_MASK                0x80


/*Register: SFIOR*/
typedef union{
	uint8 Byte;
	struct{
		uint8 PSR10 :1;
		uint8 PSR2 :1;
		uint8 PUD :1;
		uint8 ACME :1;
		uint8 :1;
		uint8 ADTS0 :1;
		uint8 ADTS1 :1;
		uint8 ADTS2 :1;
	}Bits;
}SFIOR_reg_type;
/*SFIOR Address Access Macro*/
#define SFIOR_REG      (*(volatile SFIOR_reg_type * const)0x30)
/*SFIOR Bit Macros*/
#define _SFIOR_PSR10_POSITION           0x0
#define _SFIOR_PSR10_MASK               0x1
#define _SFIOR_PSR2_POSITION            0x1
#define _SFIOR_PSR2_MASK                0x2
#define _SFIOR_PUD_POSITION             0x2
#define _SFIOR_PUD_MASK                 0x4
#define _SFIOR_ACME_POSITION            0x3
#define _SFIOR_ACME_MASK                0x8
#define _SFIOR_ADTS0_POSITION           0x5
#define _SFIOR_ADTS0_MASK               0x20
#define _SFIOR_ADTS1_POSITION           0x6
#define _SFIOR_ADTS1_MASK               0x40
#define _SFIOR_ADTS2_POSITION           0x7
#define _SFIOR_ADTS2_MASK               0x80


/*Register: TCCR1A*/
typedef union{
	uint8 Byte;
	struct{
		uint8 WGM10 :1;
		uint8 WGM11 :1;
		uint8 FOC1B :1;
		uint8 FOC1A :1;
		uint8 COM1B0 :1;
		uint8 COM1B1 :1;
		uint8 COM1A0 :1;
		uint8 COM1A1 :1;
	}Bits;
}TCCR1A_reg_type;
